#+TITLE: Introduction to Programming - Variables and Types
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 100 - Lyon College - Spring 2025
#+SEQ_TODO: PRACTICE TODO NEXT | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+options: toc:nil num:nil ^:nil: 
#+attr_latex: :float nil
#+property: :header-args:C      :main yes :includes <stdio.h> :results output :exports both
#+property: :header-args:python :session *Python* :python python3 :results output :exports both
#+property: :header-args:R      :session *R* :results graphics output file :exports both
#+property: :header-args:C++    :main yes :includes <iostream> :results output :exports both
* Printing requires format

- The =printf= function can be called as many times as you like.

- The function's argument (between parentheses) can be a string:

  #+begin_src C
    printf("Hello");
  #+end_src

  #+RESULTS:
  : Hello

- But two strings cannot be printed (you'll get a warning):

  #+begin_src C :flags -Wall
    printf("Hello, ", "world!");
  #+end_src

  #+RESULTS:
  : Hello

- In Python, this would be possible:

  #+begin_src python :results output :exports both :python python3
    print("Hello,", "world!") # print two strings
    print("Hello," + "world!") # concatenate two strings
  #+end_src

  #+RESULTS:
  : Hello, world!
  : Hello,world!

- In C, we can do this only if we tell the compiler what's coming:

  #+begin_src C :results output
    printf("%s %s\n", "Hello,", "world!"); // print two strings
  #+end_src

  #+RESULTS:
  : Hello, world!

- The command =printf= is called a /function/ that takes two arguments: A
  list of arguments and a string that contains formatting information.

- In the example:

  1) ="%s %s\n"= is the format string: "Print 2 strings and a new line".

  2) ="Hello,","world!"= is a list of two strings to be printed.

- Much of programming (not just in C) boils down to picking the right
  representations for numbers that you want the computer to work with.

- This is not unlike college algebra where the way we write numbers
  helps us see relationships and simplify operations.

- Example: Factoring $x^2 + 5x + 6 = (x+2)(x+3)$ - this representation
  helps us realize that the roots of the polynomial (where it equals
  $0$) are $x=-2$ and $x=-3$.

* Printing over multiple lines

- To print "Hello, world!" over two lines, you can use one or two
  function calls:

  #+begin_src C :results output
    printf("Hello,\n");
    printf("world!\n");
  #+end_src

  #+RESULTS:
  : Hello,
  : world!

  #+begin_src C :results output
    printf("Hello,\nworld!\n");
  #+end_src

  #+RESULTS:
  : Hello,
  : world!

* Values

- The machine only knows numbers:

  1) =1= is a whole or *integer* number:

     #+begin_src C
       printf("Integer number: %i\n", 1);
     #+end_src

     #+RESULTS:
     : Integer number: 1

  2) =1.0= is a decimal or *floating-point* number.

     #+begin_src C
       printf("Floating-point number: %.1f\n", 1.0);
     #+end_src

     #+RESULTS:
     : Floating-point number: 1.0

  3) ='1'= is a character (also stored as a number).

     #+begin_src C
       printf("Character: %c\n", '1');
     #+end_src

     #+RESULTS:
     : Character: 1

* Everything is a number

- To show that characters are stored as numbers, print it as a number:

  #+begin_src C
    printf("Character '1' as number: %i\n", '1');
  #+end_src

  #+RESULTS:
  : Character '1' as number: 49

- Though we'll mostly work with these three, C has many different ways
  of representing numbers.

- Which representation (for example, long or short) is the best
  depends on the problem.

- Example:

  1) Adding 1 + 1 and showing the result is short:

     #+begin_src C
       printf("%i + %i = %i\n", 1, 1, 1 + 1);
     #+end_src

     #+RESULTS:
     : 1 + 1 = 2

  2) Dividing Euler's number (=exp(1)= by Pi (=3.14159...=) is long:

     #+begin_src C :includes <math.h> <stdio.h>
       printf("%.19f / %.19f = %.19f\n", exp(1), M_PI, 1E+9 / M_PI);
     #+end_src

     #+RESULTS:
     : 2.7182818284590450908 / 3.1415926535897931160 = 318309886.1837906837463378906

* PRACTICE Everything is a number

- What do you get when you get the format wrong? The results will
  surprise you.

- Print these values using the requested format in a =printf= call:

  |   | VALUE | FORMAT         | SPECIFIER |
  |---+-------+----------------+-----------|
  | 1 | =3.14=  | integer        | =%i=        |
  | 2 | =3.14=  | character      | =%c=        |
  | 3 | =3=     | floating-point | =%f=        |
  | 4 | =3=     | character      | =%c=        |
  | 5 | ='3'=   | integer        | =%i=        |
  | 6 | ='3'=   | floating-point | =%f=        |

- Solution & Explanation:

  1. *Printing a floating-point number as an integer:* The output is an
     integer representation of the bits read by =printf= - it changes
     because the mismatch between the format specifier and the value
     argument causes *undefined behavior*.

     #+begin_src C :main yes :includes <stdio.h> :results output :exports both
       printf("%i\n", 3.14);
     #+end_src

     #+RESULTS:
     : -416628760

  2. *Printing a floating-point number as character*: Prints a garbage
     character (not recognized as an ASCII character).

     #+begin_src C :main yes :includes <stdio.h> :results output :exports both
       printf("%c\n", 3.14);
     #+end_src

     #+RESULTS:
     : ¸

  3. *Printing an integer as floating-point number*: Undefined behavior
     again. This result could also be another value.

     #+begin_src C :results output
       printf("%f\n", 3);
     #+end_src

     #+RESULTS:
     : 0.0

  4. *Printing an integer as character*: =3= is interpreted as the
     character with the ASCII code 3.

     #+begin_src C :results output
       printf("%c\n", 3);
     #+end_src

     #+RESULTS:
     : 

  5. *Printing a character as an integer*: Results in printing the ASCII
     code of the character.

     #+begin_src C :results output
       printf("%i\n", '3');
     #+end_src

     #+RESULTS:
     : 51

  6. *Printing a character as a floating-point number*: Undefined
     behavior.

     #+begin_src C :results output
       printf("%f\n", '3');
     #+end_src

     #+RESULTS:
     : 0.0

